IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM18_CONTROLSS_G0_EPWM18.xml
	<register id="CONTROLSS_G0_EPWM18_AQCTL" acronym="CONTROLSS_G0_EPWM18_AQCTL" offset="0x20" width="16" description="Action Qualifier Control Register">
		<bitfield id="LDAQBSYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active AQCTLB Register Load on SYNC event   00: Shadow to Active Load of AQCTLB occurs according to LDAQBMODE  01: Shadow to Active Load of AQCTLB occurs both according to LDAQBMODE bits and when SYNC occurs.  10: Shadow to Active Load of AQCTLB occurs only when a SYNC is received.  11: Reserved  Note: This bit is valid only if AQCTL[SHDWAQBMODE] = 1." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="LDAQASYNC" width="2" begin="9" end="8" resetval="0x0" description="Shadow to Active AQCTLA Register Load on SYNC event   00: Shadow to Active Load of AQCTLA occurs according to LDAQAMODE  01: Shadow to Active Load of AQCTLA occurs both according to LDAQAMODE bits and when SYNC occurs.  10: Shadow to Active Load of AQCTLA occurs only when a SYNC is received.  11: Reserved  Note: This bit is valid only if AQCTL[SHDWAQAMODE] = 1." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SHDWAQBMODE" width="1" begin="6" end="6" resetval="0x0" description="Action Qualifier B Register operating mode   1: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  0: Immediate mode - only the Active action qualifier register is used. All writes/reads via the CPU directly access the Active register." range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWAQAMODE" width="1" begin="4" end="4" resetval="0x0" description="Action Qualifier A Register operating mode   1: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  0: Immediate mode - only the Active action qualifier register is used. All writes/reads via the CPU directly access the Active register." range="4" rwaccess="R/W"/> 
		<bitfield id="LDAQBMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Action Qualifier B Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LDAQAMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Action Qualifier A Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM18_AQTSRCSEL" acronym="CONTROLSS_G0_EPWM18_AQTSRCSEL" offset="0x22" width="16" description="Action Qualifier Trigger Event Source Select Register">
		<bitfield id="T2SEL" width="4" begin="7" end="4" resetval="0x0" description="T2 Event Source Select Bits   0000: DCAEVT1  0001: DCAEVT2  0010: DCBEVT1  0011: DCBEVT2  0100: TZ1  0101: TZ2  0110: TZ3  0111: EPWMxSYNCI  1000: DCEVTFILT  Others: Reserved" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="T1SEL" width="4" begin="3" end="0" resetval="0x0" description="T1 Event Source Select Bits   0000: DCAEVT1  0001: DCAEVT2  0010: DCBEVT1  0011: DCBEVT2  0100: TZ1  0101: TZ2  0110: TZ3  0111: EPWMxSYNCI  1000: DCEVTFILT  Others: Reserved" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM18_PCCTL" acronym="CONTROLSS_G0_EPWM18_PCCTL" offset="0x28" width="16" description="PWM Chopper Control Register">
		<bitfield id="CHPDUTY" width="3" begin="10" end="8" resetval="0x0" description="Chopping Clock Duty Cycle   000: Duty = 1/8 [12.5%]  001: Duty = 2/8 [25.0%]  010: Duty = 3/8 [37.5%]  011: Duty = 4/8 [50.0%]  100: Duty = 5/8 [62.5%]  101: Duty = 6/8 [75.0%]  110: Duty = 7/8 [87.5%]  111: Reserved" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="CHPFREQ" width="3" begin="7" end="5" resetval="0x0" description="Chopping Clock Frequency   000: Divide by 1 [no prescale, = 12.5 MHz at 100 MHz TBCLK]  001: Divide by 2 [6.25 MHz at 100 MHz TBCLK]  010: Divide by 3 [4.16 MHz at 100 MHz TBCLK]  011: Divide by 4 [3.12 MHz at 100 MHz TBCLK]  100: Divide by 5 [2.50 MHz at 100 MHz TBCLK]  101: Divide by 6 [2.08 MHz at 100 MHz TBCLK]  110: Divide by 7 [1.78 MHz at 100 MHz TBCLK]  111: Divide by 8 [1.56 MHz at 100 MHz TBCLK]" range="7 - 5" rwaccess="R/W"/> 
		<bitfield id="OSHTWTH" width="4" begin="4" end="1" resetval="0x0" description="One-Shot Pulse Width   0000: 1 x EPWMCLK / 8 wide [ = 80 ns at 100 MHz EPWMCLK]  0001: 2 x EPWMCLK / 8 wide [ = 160 ns at 100 MHz EPWMCLK]  0010: 3 x EPWMCLK / 8 wide [ = 240 ns at 100 MHz EPWMCLK]  0011: 4 x EPWMCLK / 8 wide [ = 320 ns at 100 MHz EPWMCLK]  0100: 5 x EPWMCLK / 8 wide [ = 400 ns at 100 MHz EPWMCLK]  0101: 6 x EPWMCLK / 8 wide [ = 480 ns at 100 MHz EPWMCLK]  0110: 7 x EPWMCLK / 8 wide [ = 560 ns at 100 MHz EPWMCLK]  0111: 8 x EPWMCLK / 8 wide [ = 640 ns at 100 MHz EPWMCLK]  1000: 9 x EPWMCLK / 8 wide [ = 720 ns at 100 MHz EPWMCLK]  1001: 10 x EPWMCLK / 8 wide [ = 800 ns at 100 MHz EPWMCLK]  1010: 11 x EPWMCLK / 8 wide [ = 880 ns at 100 MHz EPWMCLK]  1011: 12 x EPWMCLK / 8 wide [ = 960 ns at 100 MHz EPWMCLK]  1100: 13 x EPWMCLK / 8 wide [ = 1040 ns at 100 MHz EPWMCLK]  1101: 14 x EPWMCLK / 8 wide [ = 1120 ns at 100 MHz EPWMCLK]  1110: 15 x EPWMCLK / 8 wide [ = 1200 ns at 100 MHz EPWMCLK]  1111: 16 x EPWMCLK / 8 wide [ = 1280 ns at 100 MHz EPWMCLK]" range="4 - 1" rwaccess="R/W"/> 
		<bitfield id="CHPEN" width="1" begin="0" end="0" resetval="0x0" description="PWM-Chopping Enable   0: Disable [bypass] PWM chopping function  1: Enable chopping function" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM18_VCAPCTL" acronym="CONTROLSS_G0_EPWM18_VCAPCTL" offset="0x30" width="16" description="Valley Capture Control Register">
		<bitfield id="EDGEFILTDLYSEL" width="1" begin="10" end="10" resetval="0x0" description="Valley Switching Mode Delay Selection   0: No delay applied to the edge filter output  1: HWDELAYVAL delay applied to the edge filter output" range="10" rwaccess="R/W"/> 
		<bitfield id="VDELAYDIV" width="3" begin="9" end="7" resetval="0x0" description="Valley Delay Mode Divide Enable   000: HWVDELVAL = SWVDELVAL  001: HWVDELVAL = VCNTVAL+SWVDELVAL  010: HWVDELVAL = VCNTVAL>>1+SWVDELVAL  011: HWVDELVAL = VCNTVAL>>2+SWVDELVAL  100: HWVDELVAL = VCNTVAL>>4+SWVDELVAL  Note: Delay value between the consecutive edge captures can optionally be divided by using these bits." range="9 - 7" rwaccess="R/W"/> 
		<bitfield id="TRIGSEL" width="3" begin="4" end="2" resetval="0x0" description="Status of Numbered of Captured Events   000: Capture sequence is triggered by software via writes to VCAPCTL[VCAPSTART].  001: Capture sequence is triggered by CNT_zero event.  010: Capture sequence is triggered by PRD_eq event.  011: Capture sequence is triggered by CNT_zero or PRD_eq event.  100: Capture sequence is triggered by DCAEVT1 event.  101: Capture sequence is triggered by DCAEVT2 event.  110: Capture sequence is triggered by DCBEVT1 event.  111: Capture sequence is triggered by DCBEVT2 event.  Note: Valley capture sequence triggered by the selected event in this register field. Once the chosen event occurs the capture sequence is armed. Event captures occur based of the event chosen in DCFCTL[SRCSEL] register.  Note: Same event may not be chosen in both DCFCTL[SRCSEL] and VCAPCTL[TRIGSEL] registers.  Note: Once the chosen event in VCAPCTL[TRIGSEL] occurs, irrespective of the current capture status, capture sequence is retriggered." range="4 - 2" rwaccess="R/W"/> 
		<bitfield id="VCAPSTART" width="1" begin="1" end="1" resetval="0x0" description="Valley Capture Start   0: Writing a 0 has no effect  1: Trigger the capture sequence once if VCAPCTL[TRIGSEL]=0x0  Note: This bit is used to start valley capture sequence through software. VCAPCTL[TRIGSEL] has to be chosen for software trigger for this bit to have any effect. Writing of 1 will result in one capture sequence trigger." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="VCAPE" width="1" begin="0" end="0" resetval="0x0" description="Valley Capture Enable/Disable   0: Disabled  1: Enabled" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM18_VCNTCFG" acronym="CONTROLSS_G0_EPWM18_VCNTCFG" offset="0x32" width="16" description="Valley Counter Config Register">
		<bitfield id="STOPEDGESTS" width="1" begin="15" end="15" resetval="0x0" description="Stop Edge Status Bit   0: Stop edge has not occurred  1: Stop edge occurred  Note: This bit is set only after the trigger sequence is armed [upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL]] and STOPEDGE occurs.  Note:This bit is reset by the occurrence of the trigger pulse selected through VCAPCTL[TRIGSEL]" range="15" rwaccess="R"/> 
		<bitfield id="STOPEDGE" width="4" begin="11" end="8" resetval="0x0" description="Counter Stop Edge Selection  Once the counter operation is armed, upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL] pulse - valley counter would stop counting upon the occurrence of chosen number of events thorough this bit field. Stop counting on occurrence of:   0000: Do not stop  0001  1st edge  0010: 2nd edge  0011: 3rd edge  ...  1,1,1,1: 15th edge" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="STARTEDGESTS" width="1" begin="7" end="7" resetval="0x0" description="Start Edge Status Bit   0: Start edge has not occurred  1: Start edge occurred  Note: This bit is set only after the trigger sequence is armed [upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL]] and STARTEDGE occurs.  Note:This bit is reset by the occurrence of the trigger pulse selected through VCAPCTL[TRIGSEL]" range="7" rwaccess="R"/> 
		<bitfield id="STARTEDGE" width="4" begin="3" end="0" resetval="0x0" description="Counter Start Edge Selection  Once the counter operation is armed, upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL] pulse - valley counter would start counting upon the occurrence of chosen number of events thorough this bit field. Start counting on occurrence of    0000: Do not start  0001: 1st edge  0010: 2nd edge  0011: 3rd edge  ...  1111: 15th edge" range="3 - 0" rwaccess="R/W"/>
	</register>
